# [10 Minutes to pandas — pandas 0.23.3 documentation](https://pandas.pydata.org/pandas-docs/stable/10min.html)

# Object Creation
# Viewing Data
1조: 처음~22번

# Selection
## Getting
## Selection by Label
## Selection by Position
## Boolean Indexing
## Setting
2조: 23~54번

# Missing Data
# Operations
## Stats
## Apply
## Histogramming
## String Methods
3조: 55~72번

# Merge
## Concat
## Join
## Append
4조: 73~90번

# Grouping


5조: 91~107번

# Reshaping

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

계층 적 인덱싱 및 변형에 대한 섹션을 참조하십시오.

## Stack

In [4]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))

In [5]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [6]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [7]:
df2 = df[:4]

In [8]:
df2

                     A         B
first second
bar   one     1.321056 -1.809664
      two     1.874903 -0.415736
baz   one    -0.808714  0.573662
      two     0.549350 -0.457618

stack () 메서드는 DataFrame 열의 레벨을 "압축"합니다.

In [9]:
stacked = df2.stack()

In [10]:
stacked

first  second
bar    one     A    1.321056
               B   -1.809664
       two     A    1.874903
               B   -0.415736
baz    one     A   -0.808714
               B    0.573662
       two     A    0.549350
               B   -0.457618
dtype: float64

"Stacked"DataFrame 또는 Series (MultiIndex를 인덱스로 사용) 인 경우 stack ()의 역 연산은 unstack ()이며, 기본적으로 마지막 레벨을 unstack합니다.

In [11]:
stacked.unstack()

                     A         B
first second
bar   one     1.321056 -1.809664
      two     1.874903 -0.415736
baz   one    -0.808714  0.573662
      two     0.549350 -0.457618

In [12]:
stacked.unstack(1)

second        one       two
first
bar   A  1.321056  1.874903
      B -1.809664 -0.415736
baz   A -0.808714  0.549350
      B  0.573662 -0.457618

In [13]:
stacked.unstack(0)

first          bar       baz
second
one    A  1.321056 -0.808714
       B -1.809664  0.573662
two    A  1.874903  0.549350
       B -0.415736 -0.457618

## Pivot Tables

피벗 테이블 섹션을 참조하십시오.

In [14]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})

In [15]:
df

        A  B    C         D         E
0     one  A  foo -0.701943 -0.656419
1     one  B  foo -0.471567  0.240199
2     two  C  foo -0.128653 -0.334675
3   three  A  bar -0.964232 -2.250993
4     one  B  bar -0.088475 -1.929603
5     one  C  bar  1.231824 -0.793334
6     two  A  foo -0.901103 -0.961320
7   three  B  foo  0.998334 -1.939777
8     one  C  foo  0.533768 -0.296282
9     one  A  bar -0.275955  1.389043
10    two  B  bar -0.173966  0.592765
11  three  C  bar  0.111105  1.712935

이 데이터에서 피벗 테이블을 매우 쉽게 생성 할 수 있습니다.

In [16]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.275955 -0.701943
      B -0.088475 -0.471567
      C  1.231824  0.533768
three A -0.964232       NaN
      B       NaN  0.998334
      C  0.111105       NaN
two   A       NaN -0.901103
      B -0.173966       NaN
      C       NaN -0.128653

# Time Series
6조: 108~126

# Categoricals
# Plotting
7조: 127~140

# Getting Data In/Out

## CSV

## HDF5

## Excel

# Gotchas

작업을 수행하려고 시도하면 다음과 같은 예외 상황을 볼 수도 있습니다 :

In [2]:
    if pd.Series([False, True, False]):
    print("I was true")

IndentationError: expected an indented block (<ipython-input-2-9074a2390e8e>, line 2)

설명 및 수행 할 작업은 [비교](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-compare)를 참조하십시오.

[Gotchas](https://pandas.pydata.org/pandas-docs/stable/gotchas.html#gotchas)도 참조하십시오.

8조: 141~끝

In [ ]:
ㅋ